export type ProcessType = '横竖分切' | '破片' | '直切' | '冲型' | '背胶' | '点胶' | '贴布' | '打包' | '改回填' | '粘胶';
export type ProcessStatus = 'waiting' | 'ready' | 'running' | 'paused' | 'done' | 'rework' | 'skipped';
export type ProcessTemplate = '片材' | '片材切片' | '片材冲型' | '片材切片冲型' | '切片冲型' | '片材背胶' | '片材背胶冲型' | '片材背胶切片' | '片材背胶切片冲型' | '片材贴布' | '片材贴布冲型' | '片材贴布切片' | '片材贴布切片冲型' | '片材背胶贴布' | '片材背胶贴布冲型' | '片材背胶贴布切片冲型' | '片材切片冲型点胶' | '片材贴布切片冲型点胶' | '库存片材' | '库存切片' | '库存冲型' | '库存切片冲型' | '改回填' | '热熔胶' | '点胶' | '打包';
export type PunchType = '单冲' | '连冲' | '复合冲';

export const PROCESS_TEMPLATE_MAP: Record<ProcessTemplate, ProcessType[]> = {
  '片材': ['横竖分切', '破片'],
  '片材切片': ['横竖分切', '破片', '直切'],
  '片材冲型': ['横竖分切', '破片', '冲型'],
  '片材切片冲型': ['横竖分切', '破片', '直切', '冲型'],
  '切片冲型': ['直切', '冲型'],
  '片材背胶': ['横竖分切', '破片', '背胶'],
  '片材背胶冲型': ['横竖分切', '破片', '冲型', '背胶'],
  '片材背胶切片': ['横竖分切', '破片', '直切', '背胶'],
  '片材背胶切片冲型': ['横竖分切', '破片', '直切', '冲型', '背胶'],
  '片材贴布': ['横竖分切', '破片', '贴布'],
  '片材贴布冲型': ['横竖分切', '破片', '冲型', '贴布'],
  '片材贴布切片': ['横竖分切', '破片', '直切', '贴布'],
  '片材贴布切片冲型': ['横竖分切', '破片', '直切', '冲型', '贴布'],
  '片材背胶贴布': ['横竖分切', '破片', '背胶', '贴布'],
  '片材背胶贴布冲型': ['横竖分切', '破片', '冲型', '背胶', '贴布'],
  '片材背胶贴布切片冲型': ['横竖分切', '破片', '直切', '冲型', '背胶', '贴布'],
  '片材切片冲型点胶': ['横竖分切', '破片', '直切', '冲型', '点胶'],
  '片材贴布切片冲型点胶': ['横竖分切', '破片', '直切', '冲型', '贴布', '点胶'],
  '库存片材': ['直切'],
  '库存切片': ['直切'],
  '库存冲型': ['冲型'],
  '库存切片冲型': ['直切', '冲型'],
  '改回填': ['改回填'],
  '热熔胶': ['背胶'],
  '点胶': ['点胶'],
  '打包': ['打包'],
};

export const PROCESS_ORDER: Record<ProcessType, number> = {
  '横竖分切': 1, '破片': 2, '直切': 3, '冲型': 4,
  '背胶': 5, '贴布': 6, '点胶': 7, '粘胶': 8,
  '改回填': 9, '打包': 10,
};

export const PROCESS_WORKER_MAP: Record<ProcessType, string> = {
  '横竖分切': '郑思远', '破片': '伍乾进', '直切': '莫齐国', '冲型': '李乐',
  '背胶': '简翠花', '点胶': '简翠花', '贴布': '简翠花', '打包': '杨合进',
  '改回填': '郑思远', '粘胶': '简翠花',
};

export const PROCESS_MACHINE_MAP: Record<ProcessType, string> = {
  '横竖分切': '横竖分切机', '破片': '破片机', '直切': '直切机', '冲型': '冲床',
  '背胶': '热熔胶机', '点胶': '点胶机', '贴布': '热熔胶机', '打包': '打包台',
  '改回填': '改回填机', '粘胶': '热熔胶机',
};
